# Используем официальный образ Python 3.10 в минимальной версии
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# Копируем файл зависимостей в рабочую директорию
# Render будет использовать его для установки aiogram 3.10.0 и т.д.
COPY requirements.txt ./

# Устанавливаем все зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы проекта в рабочую директорию
COPY . .

# Команда, которая будет запускаться при старте контейнера
# Она запускает ваш скрипт main.py
CMD ["python", "main.py"]
